const SIXIANG_WITH_CAPTIONS = [
  ['爻象', '名', '拼音'],

  ["⚊", "阳爻", "yángyáo"],
  ["⚋", "阴爻", "yīnyáo"],

  ["⚌", "太阳", "tàiyáng"],
  ["⚍", "少阴", "shǎoyīn"],

  ["⚎", "少阳", "shǎoyáng"],
  ["⚏", "太阴", "tàiyīn"],
];

const SIXIANG = SIXIANG_WITH_CAPTIONS.slice(1);


const BAGUA_WITH_CAPTIONS = [
  ['卦象', '卦名', '拼音', "自然象征", "性情", "家族关系", "动物", "身体部位", "器官", "方位", "五行"],

  ["☰", "乾", "qián", "天", "健", "父", "马", "头", "脑", "南", "金"],
  ["☱", "兑", "duì",  "泽", "悦", "少女", "羊", "口", "肺", "东南", "金"],

  ["☲", "离", "lí",   "火", "丽", "中女", "雉", "目", "心", "东", "火"],
  ["☳", "震", "zhèn", "雷", "动", "长男", "龙", "足", "肝", "东北", "木"],

  ["☴", "巽", "xùn",  "风", "入", "长女", "鸡", "股", "胆", "西南", "木"],
  ["☵", "坎", "kǎn",  "水", "陷", "中男", "豕", "耳", "肾", "西", "水"],

  ["☶", "艮", "gěn",  "山", "止", "少男", "狗", "手", "胃", "西北", "土"],
  ["☷", "坤", "kūn",  "地", "顺", "母", "牛", "腹", "脾", "北", "土"],
];
[
  "☰", "乾", "天", "健", "父", "马", "头", "脑", "南", "西北", "金", "111", "U+2630",
  "☱", "兑", "泽", "悦", "少女", "羊", "口", "肺", "东南", "西", "金", "110", "U+2631",
  "☲", "离", "火", "丽", "中女", "雉", "目", "心", "东", "南", "火", "101", "U+2632",
  "☳", "震", "雷", "动", "长男", "龙", "足", "肝", "东北", "东", "木", "100", "U+2633",
  "☴", "巽", "风", "入", "长女", "鸡", "股", "胆", "西南", "东南", "木", "011", "U+2634",
  "☵", "坎", "水", "陷", "中男", "豕", "耳", "肾", "西", "北", "水", "010", "U+2635",
  "☶", "艮", "山", "止", "少男", "狗", "手", "胃", "西北", "东北", "土", "001", "U+2636",
  "☷", "坤", "地", "顺", "母", "牛", "腹", "脾", "北", "西南", "土", "000", "U+2637"
]



const BAGUA = BAGUA_WITH_CAPTIONS.slice(1);

const X64 = [
  ["䷁", "䷖", "䷇", "䷓", "䷏", "䷢", "䷬", "䷋",
    "䷎", "䷳", "䷦", "䷴", "䷽", "䷷", "䷞", "䷠",
    "䷆", "䷃", "䷜", "䷺", "䷧", "䷿", "䷮", "䷅",
    "䷭", "䷑", "䷯", "䷸", "䷟", "䷱", "䷛", "䷫",
    "䷗", "䷚", "䷂", "䷩", "䷲", "䷔", "䷐", "䷘",
    "䷣", "䷕", "䷾", "䷤", "䷶", "䷝", "䷰", "䷌",
    "䷒", "䷨", "䷻", "䷼", "䷵", "䷥", "䷹", "䷉",
    "䷊", "䷙", "䷄", "䷈", "䷡", "䷍", "䷪", "䷀"],
  ["坤", "剥", "比", "观", "豫", "晋", "萃", "否",
    "谦", "艮", "蹇", "渐", "小过", "旅", "咸", "遁",
    "师", "蒙", "坎", "涣", "解", "未济", "困", "讼",
    "升", "蛊", "井", "巽", "恒", "鼎", "大过", "姤",
    "复", "颐", "屯", "益", "震", "噬嗑", "随", "无妄",
    "明夷", "贲", "既济", "家人", "丰", "离", "革", "同人",
    "临", "损", "节", "中孚", "归妹", "睽", "兑", "履",
    "泰", "大畜", "需", "小畜", "大壮", "大有", "夬", "乾"],
  ["kūn", "bāo", "bǐ", "guān", "yù", "jìn", "cuì", "fǒu",
    "qiān", "gèn", "jiǎn", "jiàn", "xiǎoguò", "lǚ", "xián", "dùn",
    "shī", "mēng", "kǎn", "huàn", "jiě", "wèijì", "kùn", "sòng",
    "shēng", "gǔ", "jǐng", "xùn", "héng", "dǐng", "dàguò", "gòu",
    "fù", "yí", "tún", "yì", "zhèn", "shìkē", "suí", "wúwàng",
    "míngyí", "bì", "jìjì", "jiārén", "fēng", "lí", "gé", "tóngrén",
    "lín", "sǔn", "jié", "zhōngfú", "guīmèi", "kuí", "duì", "lǚ",
    "tài", "dàxù", "xū", "xiǎoxù", "dàzhuàng", "dàyǒu", "guài", "qian"],
  // Links for https://ctext.org/book-of-changes/zhs
  ["kun", "bao", "bi", "guan", "yu", "jin", "cui", "fou",
    "qian", "gen", "jian", "jian", "xiaoguo", "lu1", "xian", "dun",
    "shi", "meng", "kan", "huan", "jie", "weiji", "kun", "song",
    "sheng", "gu", "jing", "xun", "heng", "ding", "daguo", "gou",
    "fu", "yi", "tun", "yi", "zhen", "shike", "sui", "wuwang",
    "mingyi", "bi", "jiji", "jiaren", "feng", "li", "ge", "tongren",
    "lin", "sun", "jie", "zhongfu", "guimei", "kui", "dui", "lu",
    "tai", "daxu", "xu", "xiaoxu", "dazhuang", "dayou", "guai", "qian"]
]

function getGua(index, withLink = true) {
  let html = `${X64[0][index]}<ruby>${X64[1][index]}<rt>${X64[2][index]}</rt></ruby>`;
  if (withLink) {
    // ens for English, zhs for Simplied, zh for Traditional
    html = `<a href="https://ctext.org/book-of-changes/${X64[3][index]}/ens", target="_blank">${html}</a>`;
  }
  return html;
}
